tschissler/SmartHomeTS/ESP32Firmwares/RelaisBoard.Firmware/src/main.cpp
#include <Arduino.h>
#include <ArduinoJson.h>
#include <map>
#include <set>
#include <NTPClient.h>
#include <time.h>
#include <Preferences.h>
#include <esp_idf_version.h>
#include <esp_system.h>
#include <esp_task_wdt.h>

#include <esp_mac.h>
#include "AzureOTAUpdater.h"
#include "MQTTClientLib.h"
#include "WifiLib.h"

#define NUMBER_OF_RELAYS 8
#define RELAIS_1 19  
#define RELAIS_2 18
#define RELAIS_3 5
#define RELAIS_4 17
#define RELAIS_5 16
#define RELAIS_6 4
#define RELAIS_7 0
#define RELAIS_8 15

// The solid state relay board switches on a LOW level
#define RELAY_ON  LOW
#define RELAY_OFF HIGH

// Timing of the main loop and its periodic jobs
static const uint32_t LOOP_INTERVAL_MS          = 50;
static const uint32_t MQTT_RETRY_MIN_MS         = 2000;
static const uint32_t MQTT_RETRY_MAX_MS         = 60000;
static const uint32_t BROKER_PROBE_TIMEOUT_MS   = 3000;
static const uint32_t SUBSCRIBE_RETRY_MS        = 5000;
static const uint32_t WIFI_RECOVER_AFTER_MS     = 30000;
static const uint32_t HEARTBEAT_INTERVAL_MS     = 60000;
static const uint32_t STATE_REPUBLISH_MS        = 300000;
static const uint32_t OTA_RETRY_COOLDOWN_MS     = 600000;
static const uint32_t SELFTEST_STEP_MS          = 100;

// Last line of defence: if the loop is stuck (blocking library call) the task watchdog
// reboots the board, if MQTT stays unreachable for this long we reboot deliberately.
static const uint32_t WATCHDOG_TIMEOUT_MS       = 180000;
static const uint32_t MQTT_STALE_REBOOT_MS      = 900000;

static const char* NVS_NAMESPACE  = "relaisboard";
static const char* NVS_KEY_NAME   = "sensorname";
static const char* NVS_KEY_CONFIG = "roomconfig";
static const char* NVS_KEY_STATE  = "relaystate";

const char* version = FIRMWARE_VERSION;
String chipID = "";

// Room to pin mapping (will be populated from MQTT config)
std::map<String, int> roomToPinMapping;

// Desired relay state per room, mirrored to NVS so a reboot restores the valve positions
std::map<String, bool> desiredRelayState;

// Rooms whose state still needs to be published (never publish from the MQTT callback)
std::set<String> pendingStatePublishes;

// Array of available relay pins for easier management
const int relayPins[NUMBER_OF_RELAYS] = {
  RELAIS_1, RELAIS_2, RELAIS_3, RELAIS_4, 
  RELAIS_5, RELAIS_6, RELAIS_7, RELAIS_8
};

// WiFi credentials are read from environment variables and used during compile-time (see platformio.ini)
// Set WIFI_PASSWORDS as environment variables on your dev-system following the pattern: WIFI_PASSWORDS="ssid1;password1|ssid2;password2"
WifiLib wifiLib(WIFI_PASSWORDS);

WiFiClient wifiClient;
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "pool.ntp.org", 3600, 60000); // UTC+1, update every 60 seconds
std::unique_ptr<MQTTClientLib> mqttClient = nullptr;
Preferences preferences;

static bool otaEnable = true;
static bool otaStarted = false;
static String otaPendingUrl = "";
static uint32_t otaBlockedUntilMs = 0;
static uint32_t otaFailures = 0;

static String sensorName = "";
static String location = "";
const String mqtt_broker = "mosquitto.intern";
const int mqtt_port = 1883;
static String mqtt_OTAtopic = "OTAUpdate/Relaismodule";
static String mqtt_SensornameTopic = "config/Relaismodule/Sensorname/";
static String mqtt_config_Base = "config/Relaismodule/";
static String mqtt_config_Topic = "";
static String mqtt_CommandsTopic = "commands/Heating/#";
static String mqtt_Data_Topic = "";
static String mqtt_Status_Topic = "";

// Subscription bookkeeping. Every flag is cleared on every (re)connect and is only set
// once the broker has actually acknowledged the subscription.
static bool subscribedToSensorname = false;
static bool subscribedToOta = false;
static bool subscribedToConfig = false;
static bool subscribedToCommands = false;
static uint32_t nextSubscribeAttemptMs = 0;

static bool watchdogActive = false;
static bool mqttConnected = false;
static uint32_t mqttRetryDelayMs = MQTT_RETRY_MIN_MS;
static uint32_t nextMqttAttemptMs = 0;
static uint32_t lastMqttOkMs = 0;
static uint32_t lastWifiOkMs = 0;
static uint32_t lastHeartbeatMs = 0;
static uint32_t lastStateRepublishMs = 0;
static uint32_t mqttReconnects = 0;
static uint32_t wifiReconnects = 0;

// ---------------------------------------------------------------------------
// Watchdog
// ---------------------------------------------------------------------------

// millis() wraps around after ~49 days. Comparing the signed difference keeps every
// deadline check correct across the wrap, a plain "millis() < deadline" would not.
bool deadlineReached(uint32_t deadlineMs) {
  return (int32_t)(millis() - deadlineMs) >= 0;
}

void feedWatchdog() {
  if (watchdogActive) {
    esp_task_wdt_reset();
  }
}

void setupWatchdog() {
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_config_t config = {
    .timeout_ms = WATCHDOG_TIMEOUT_MS,
    .idle_core_mask = 0,
    .trigger_panic = true
  };
  esp_err_t err = esp_task_wdt_init(&config);
  if (err == ESP_ERR_INVALID_STATE) {
    // The Arduino core already initialised the watchdog with a much shorter timeout
    err = esp_task_wdt_reconfigure(&config);
  }
#else
  esp_err_t err = esp_task_wdt_init(WATCHDOG_TIMEOUT_MS / 1000, true);
#endif

  if (err == ESP_OK && esp_task_wdt_add(NULL) == ESP_OK) {
    watchdogActive = true;
    Serial.println("Task watchdog armed with " + String(WATCHDOG_TIMEOUT_MS / 1000) + "s timeout");
  } else {
    Serial.println("Failed to arm task watchdog, error " + String(err));
  }
}

String getResetReason() {
  switch (esp_reset_reason()) {
    case ESP_RST_POWERON:  return "poweron";
    case ESP_RST_EXT:      return "external";
    case ESP_RST_SW:       return "software";
    case ESP_RST_PANIC:    return "panic";
    case ESP_RST_INT_WDT:  return "interrupt_watchdog";
    case ESP_RST_TASK_WDT: return "task_watchdog";
    case ESP_RST_WDT:      return "other_watchdog";
    case ESP_RST_BROWNOUT: return "brownout";
    default:               return "unknown";
  }
}

// ---------------------------------------------------------------------------
// Relay handling
// ---------------------------------------------------------------------------

int getRelayPinByNumber(int pinNumber) {
  if (pinNumber >= 1 && pinNumber <= NUMBER_OF_RELAYS) {
    return relayPins[pinNumber - 1]; 
  }
  return -1; // Invalid pin number
}

int getRelayPinForRoom(const String& roomName) {
  auto it = roomToPinMapping.find(roomName);
  if (it != roomToPinMapping.end()) {
    return it->second;
  }
  return -1; // Room not found
}

void initializeRelayPins() {
  // Drive the outputs to the off level *before* switching them to OUTPUT, otherwise every
  // relay is energized for the whole duration of setup(). Note that RELAIS_7 sits on GPIO0,
  // a strapping pin: pulling it low while the ESP32 resets puts the chip into download mode.
  for (int i = 0; i < NUMBER_OF_RELAYS; i++) {
    digitalWrite(relayPins[i], RELAY_OFF);
    pinMode(relayPins[i], OUTPUT);
    digitalWrite(relayPins[i], RELAY_OFF);
  }
}

