tschissler/SmartHomeTS/ESP32Firmwares/RelaisBoard.Firmware/src/main.cpp
// Pulses every relay once on boot. The valve LEDs are the only local feedback that the
// board has restarted, so this runs before the stored state is restored on top of it.
void runRelaySelfTest() {
  Serial.println("Running relay self test...");
  for (int i = 0; i < NUMBER_OF_RELAYS; i++) {
    digitalWrite(relayPins[i], RELAY_ON);
    delay(SELFTEST_STEP_MS);
  }
  for (int i = 0; i < NUMBER_OF_RELAYS; i++) {
    digitalWrite(relayPins[i], RELAY_OFF);
    delay(SELFTEST_STEP_MS);
  }
}

void persistDesiredState() {
  JsonDocument doc;
  for (const auto& entry : desiredRelayState) {
    doc[entry.first] = entry.second;
  }

  String serialized;
  serializeJson(doc, serialized);

  // Only touch NVS when something actually changed to keep the flash wear low
  if (preferences.getString(NVS_KEY_STATE, "") != serialized) {
    preferences.putString(NVS_KEY_STATE, serialized);
  }
}

void restoreDesiredState() {
  String stored = preferences.getString(NVS_KEY_STATE, "");
  if (stored.isEmpty()) {
    return;
  }

  JsonDocument doc;
  if (deserializeJson(doc, stored)) {
    Serial.println("Stored relay state is corrupt, ignoring it");
    return;
  }

  for (JsonPair entry : doc.as<JsonObject>()) {
    desiredRelayState[String(entry.key().c_str())] = entry.value().as<bool>();
  }
  Serial.println("Restored desired state for " + String(desiredRelayState.size()) + " rooms from NVS");
}

// Applies the desired state to every mapped relay. Rooms without a known desired state
// stay off, which is the safe position for a heating valve.
void applyDesiredState() {
  for (const auto& mapping : roomToPinMapping) {
    auto it = desiredRelayState.find(mapping.first);
    bool on = (it != desiredRelayState.end()) && it->second;
    digitalWrite(mapping.second, on ? RELAY_ON : RELAY_OFF);
    pendingStatePublishes.insert(mapping.first);
  }
}

void setRelayForRoom(const String& roomName, bool on) {
  int relayPin = getRelayPinForRoom(roomName);
  if (relayPin == -1) {
    return;
  }

  digitalWrite(relayPin, on ? RELAY_ON : RELAY_OFF);
  desiredRelayState[roomName] = on;
  persistDesiredState();
  pendingStatePublishes.insert(roomName);

  Serial.println("Relay for room '" + roomName + "' turned " + (on ? "ON" : "OFF") +
                 " (GPIO " + String(relayPin) + ")");
}

bool updateRoomMapping(const String& jsonConfig) {
  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, jsonConfig);
  
  if (error) {
    Serial.println("Failed to parse room mapping JSON: " + String(error.c_str()));
    return false;
  }
  
  if (!doc.is<JsonArray>()) {
    Serial.println("Room mapping JSON must be an array");
    return false;
  }

  std::map<String, int> newMapping;
  JsonArray rooms = doc.as<JsonArray>();
  
  for (JsonObject room : rooms) {
    if (!room["Room"].is<String>() || !room["Pin"].is<int>()) {
      Serial.println("Room mapping entry missing 'Room' or 'Pin' field");
      continue;
    }
    
    String roomName = room["Room"].as<String>();
    int pinNumber = room["Pin"].as<int>();
    
    int actualPin = getRelayPinByNumber(pinNumber);
    if (actualPin == -1) {
      Serial.println("Invalid pin number " + String(pinNumber) + " for room " + roomName);
      continue;
    }
    
    newMapping[roomName] = actualPin;
    Serial.println("Mapped room '" + roomName + "' to pin " + String(pinNumber) + " (GPIO " + String(actualPin) + ")");
  }

  if (newMapping.empty()) {
    Serial.println("Room mapping contains no usable entry, keeping the previous one");
    return false;
  }

  // Release relays that are no longer mapped so they cannot stay stuck in the on position
  for (const auto& mapping : roomToPinMapping) {
    if (newMapping.find(mapping.first) == newMapping.end()) {
      digitalWrite(mapping.second, RELAY_OFF);
    }
  }

  roomToPinMapping = newMapping;
  applyDesiredState();

  Serial.println("Room mapping updated with " + String(roomToPinMapping.size()) + " rooms");
  return true;
}

// ---------------------------------------------------------------------------
// Time
// ---------------------------------------------------------------------------

String getCurrentTimestamp() {
  // No update() call here: the main loop keeps the NTP client fresh and update() may block
  unsigned long epochTime = timeClient.getEpochTime();
  if (epochTime < 1600000000UL) {
    return "";
  }

  time_t rawTime = (time_t)epochTime;
  struct tm *ptm = gmtime(&rawTime);
  
  char timestamp[25];
  sprintf(timestamp, "%04d-%02d-%02d %02d:%02d:%02d",
          ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday,
          ptm->tm_hour, ptm->tm_min, ptm->tm_sec);
  
  return String(timestamp);
}

// ---------------------------------------------------------------------------
// MQTT publishing
// ---------------------------------------------------------------------------

void publishRelayState(const String& roomName) {
  if (!mqttConnected || mqtt_Data_Topic.isEmpty()) {
    return;
  }

  auto it = desiredRelayState.find(roomName);
  bool on = (it != desiredRelayState.end()) && it->second;

  JsonDocument doc;
  doc["state"] = on ? "ON" : "OFF";
  doc["timestamp"] = getCurrentTimestamp();
  
  String jsonOutput;
  serializeJson(doc, jsonOutput);
  
  mqttClient->publish(mqtt_Data_Topic + roomName, jsonOutput, true, 1, false);
}

void publishPendingStates() {
  if (!mqttConnected || pendingStatePublishes.empty()) {
    return;
  }

  // One room per loop iteration keeps the publish (QoS 1, waits for PUBACK) off the
  // critical path even when the whole state is republished at once.
  auto it = pendingStatePublishes.begin();
  String roomName = *it;
  pendingStatePublishes.erase(it);
  publishRelayState(roomName);
}

void publishHeartbeat() {
  if (!mqttConnected || mqtt_Status_Topic.isEmpty()) {
    return;
  }

  JsonDocument doc;
  doc["version"] = version;
  doc["chipId"] = chipID;
  doc["ip"] = WiFi.localIP().toString();
  doc["rssi"] = WiFi.RSSI();
  doc["uptimeSeconds"] = millis() / 1000;
  doc["freeHeap"] = ESP.getFreeHeap();
  doc["resetReason"] = getResetReason();
  doc["wifiReconnects"] = wifiReconnects;
  doc["mqttReconnects"] = mqttReconnects;
  doc["otaFailures"] = otaFailures;
  doc["timestamp"] = getCurrentTimestamp();

