tschissler/SmartHomeTS/ESP32Firmwares/RelaisBoard.Firmware/src/main.cpp
  JsonObject relays = doc["relays"].to<JsonObject>();
  for (const auto& mapping : roomToPinMapping) {
    auto it = desiredRelayState.find(mapping.first);
    relays[mapping.first] = ((it != desiredRelayState.end()) && it->second) ? "ON" : "OFF";
  }

  String jsonOutput;
  serializeJson(doc, jsonOutput);

  mqttClient->publish(mqtt_Status_Topic, jsonOutput, true, 0, false);
}

// ---------------------------------------------------------------------------
// MQTT subscriptions
// ---------------------------------------------------------------------------

void applySensorName(const String& name) {
  if (name.isEmpty()) {
    return;
  }

  sensorName = name;
  location = name;
  location.replace("Relaismodule_", "");

  String newConfigTopic = mqtt_config_Base + sensorName + "/Relais";
  if (newConfigTopic != mqtt_config_Topic) {
    if (!mqtt_config_Topic.isEmpty() && mqttConnected) {
      mqttClient->unsubscribe(mqtt_config_Topic);
    }
    mqtt_config_Topic = newConfigTopic;
    subscribedToConfig = false;
  }

  mqtt_Data_Topic = "daten/Heizung/" + location + "/FussbodenHeizungSteuerung";
  mqtt_Status_Topic = "meta/" + sensorName + "/status/RelaisModule";

  Serial.println("Sensor name set to: " + sensorName);
  Serial.println("Location set to: " + location);
  Serial.println("Config topic set to: " + mqtt_config_Topic);

  if (preferences.getString(NVS_KEY_NAME, "") != sensorName) {
    preferences.putString(NVS_KEY_NAME, sensorName);
  }
}

void resetSubscriptions() {
  subscribedToSensorname = false;
  subscribedToOta = false;
  subscribedToConfig = false;
  subscribedToCommands = false;
  nextSubscribeAttemptMs = millis();
}

// Re-establishes every subscription that is currently missing. A flag is only latched
// once the broker acknowledged the SUBSCRIBE, so a failed attempt is retried instead of
// silently leaving the board deaf.
void syncSubscriptions() {
  if (!mqttConnected) {
    return;
  }
  if (subscribedToSensorname && subscribedToOta && subscribedToConfig && subscribedToCommands) {
    return;
  }
  if (!deadlineReached(nextSubscribeAttemptMs)) {
    return;
  }
  nextSubscribeAttemptMs = millis() + SUBSCRIBE_RETRY_MS;

  if (!subscribedToSensorname) {
    subscribedToSensorname = mqttClient->subscribe(mqtt_SensornameTopic);
  }
  if (!subscribedToOta) {
    subscribedToOta = mqttClient->subscribe(mqtt_OTAtopic);
  }
  if (!subscribedToConfig && !mqtt_config_Topic.isEmpty()) {
    subscribedToConfig = mqttClient->subscribe(mqtt_config_Topic);
  }
  if (!subscribedToCommands && !roomToPinMapping.empty()) {
    subscribedToCommands = mqttClient->subscribe(mqtt_CommandsTopic);
  }
}

// ---------------------------------------------------------------------------
// MQTT callback
// ---------------------------------------------------------------------------

void mqttCallback(String &topic, String &payload) {
    Serial.println("Message arrived on topic: " + topic + ". Message: " + payload);

    // Handle room configuration updates
    if (topic == mqtt_config_Topic) {
      Serial.println("Received room configuration update");
      if (updateRoomMapping(payload)) {
        preferences.putString(NVS_KEY_CONFIG, payload);
        Serial.println("Room mapping configuration updated successfully");
      } else {
        Serial.println("Failed to update room mapping configuration");
      }
      return;
    }

    // Handle heating commands with dynamic room mapping
    if (topic.startsWith("commands/Heating/")) {
      String roomName = topic.substring(String("commands/Heating/").length());
      if (getRelayPinForRoom(roomName) == -1) {
        // The wildcard subscription also receives the rooms of the other relay boards
        return;
      }

      String payloadUpper = payload;
      payloadUpper.toUpperCase();
      if (payloadUpper == "ON") {
          setRelayForRoom(roomName, true);
      } else if (payloadUpper == "OFF") {
          setRelayForRoom(roomName, false);
      } else {
          Serial.println("Invalid payload for relay command. Use 'ON' or 'OFF'.");
      }
      return;
    }

    if (topic == mqtt_SensornameTopic) {
      applySensorName(payload);
      return;
    } 

    if (topic == mqtt_OTAtopic) {
      if (!otaEnable) {
        Serial.println("OTA disabled, ignoring message");
        return;
      }
      if (otaStarted) {
        Serial.println("OTA in progress, ignoring message");
        return;
      }
      if (!deadlineReached(otaBlockedUntilMs)) {
        Serial.println("OTA is in cooldown after a failed update, ignoring message");
        return;
      }
  
      String updateVersion = AzureOTAUpdater::ExtractVersionFromUrl(payload);
      Serial.println("Current firmware version is " + String(version));
      Serial.println("New firmware version is " + updateVersion);
      if(strcmp(version, updateVersion.c_str())) {
          // Remember the request only - starting the download from inside the MQTT
          // callback would run it while the MQTT client is parsing an incoming packet
          otaPendingUrl = payload;
      }
      else {
        Serial.println("Firmware is up to date");
      }
      return;
    }

    Serial.println("Unknown topic, ignoring message");
}

// ---------------------------------------------------------------------------
// OTA
// ---------------------------------------------------------------------------

// Returns true while an update is running and the rest of the loop has to stand back.
bool handleOta() {
  if (otaStarted) {
    int status = AzureOTAUpdater::CheckUpdateStatus();
    if (status == 1) {
      return true;
    }

    // Anything else means the update is over. HttpsOTA keeps reporting FAIL forever, so
    // the status must only be read while an update of ours is actually running.
    otaStarted = false;
    if (status < 0) {
      otaFailures++;
      otaBlockedUntilMs = millis() + OTA_RETRY_COOLDOWN_MS;
      Serial.println("OTA update failed, resuming normal operation");
    }
    return false;
  }

  if (otaPendingUrl.isEmpty()) {
    return false;
  }

  String url = otaPendingUrl;
  otaPendingUrl = "";
  Serial.println("New firmware available, starting OTA Update from " + url);
  otaStarted = AzureOTAUpdater::UpdateFirmwareFromUrl(url.c_str());
  return otaStarted;
}

// ---------------------------------------------------------------------------
// Connectivity
// ---------------------------------------------------------------------------

void ensureWifiConnected() {
  if (WiFi.status() == WL_CONNECTED) {
    lastWifiOkMs = millis();
    return;
  }

