tschissler/SmartHomeTS/ESP32Firmwares/RelaisBoard.Firmware/src/main.cpp
  // Give the auto-reconnect of the WiFi stack a chance before taking over
  if (millis() - lastWifiOkMs < WIFI_RECOVER_AFTER_MS) {
    return;
  }

  Serial.println("WiFi has been down for more than " + String(WIFI_RECOVER_AFTER_MS / 1000) +
                 "s, rescanning and reconnecting...");
  wifiReconnects++;
  WiFi.disconnect(false);

  // The rescan is essential: connect() pins itself to the BSSID picked at boot time and
  // would otherwise keep retrying an access point that is no longer there.
  wifiLib.scanAndSelectNetwork();
  wifiLib.connect();
  lastWifiOkMs = millis();
}

// A plain TCP probe before handing over to MQTTClientLib::connect(), which loops forever
// until the broker answers. If the broker is down we stay in the loop and keep the
// watchdog, the heartbeat and the serial diagnostics alive.
bool isBrokerReachable() {
  WiFiClient probe;
  bool reachable = probe.connect(mqtt_broker.c_str(), mqtt_port, BROKER_PROBE_TIMEOUT_MS);
  probe.stop();
  return reachable;
}

void connectToMQTT() {
  if (!deadlineReached(nextMqttAttemptMs)) {
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    nextMqttAttemptMs = millis() + MQTT_RETRY_MIN_MS;
    return;
  }

  if (!isBrokerReachable()) {
    Serial.println("MQTT broker " + mqtt_broker + " is not reachable, retrying in " +
                   String(mqttRetryDelayMs / 1000) + "s");
    nextMqttAttemptMs = millis() + mqttRetryDelayMs;
    mqttRetryDelayMs = min(mqttRetryDelayMs * 2, MQTT_RETRY_MAX_MS);
    return;
  }

  // Always connect with a clean session and rebuild every subscription ourselves. Relying
  // on a broker side session silently loses all subscriptions whenever Mosquitto restarts.
  mqttClient->connect(true);
  mqttConnected = true;
  mqttReconnects++;
  lastMqttOkMs = millis();
  mqttRetryDelayMs = MQTT_RETRY_MIN_MS;
  resetSubscriptions();
  syncSubscriptions();

  Serial.println("MQTT Client is connected (reconnect #" + String(mqttReconnects) + ")");

  if (!sensorName.isEmpty()) {
    mqttClient->publish("meta/" + sensorName + "/version/RelaisModule", String(version), true, 0);
  }

  // Publish the current state right away so consumers see where we stand after a reconnect
  for (const auto& mapping : roomToPinMapping) {
    pendingStatePublishes.insert(mapping.first);
  }
  // Due immediately, so a reconnect is visible on the status topic right away
  lastHeartbeatMs = millis() - HEARTBEAT_INTERVAL_MS;
}

// ---------------------------------------------------------------------------
// Setup / loop
// ---------------------------------------------------------------------------

void setup() {
  Serial.begin(115200);

  initializeRelayPins();

  Serial.print("Relais Module Version:");
  Serial.println(version);
  Serial.println("Reset reason: " + getResetReason());
  Serial.println("-------------------------------------------------------");

  setupWatchdog();
  runRelaySelfTest();

  uint8_t mac[6];
  esp_read_mac(mac, ESP_MAC_WIFI_STA);

  chipID = "";
  for (int i = 0; i < 6; ++i) {
    if (mac[i] < 0x10) chipID += "0";  // Add leading zero if needed
    chipID += String(mac[i], HEX);
  }

  Serial.print("ESP32 Chip ID: ");
  Serial.println(chipID);

  mqtt_SensornameTopic += chipID;

  // Restore the last known configuration and valve positions before going online, so a
  // reboot does not depend on the broker being available.
  preferences.begin(NVS_NAMESPACE, false);
  restoreDesiredState();
  applySensorName(preferences.getString(NVS_KEY_NAME, ""));
  String storedConfig = preferences.getString(NVS_KEY_CONFIG, "");
  if (!storedConfig.isEmpty()) {
    Serial.println("Restoring room mapping from NVS");
    updateRoomMapping(storedConfig);
  }

  feedWatchdog();

  // Connect to WiFi
  Serial.print("Connecting to WiFi ");
  wifiLib.scanAndSelectNetwork();
  wifiLib.connect();
  lastWifiOkMs = millis();

  feedWatchdog();

  // Initialize NTP Client
  Serial.println("Starting NTP client...");
  timeClient.begin();
  timeClient.update();
  Serial.println("NTP time synchronized: " + getCurrentTimestamp());

  feedWatchdog();

  // Set up MQTT. The connection itself is established by the loop, which keeps setup()
  // from blocking forever while the broker is unavailable.
  String mqttClientID = "ESP32RelaismoduleClient_" + chipID;
  mqttClient = std::unique_ptr<MQTTClientLib>(new MQTTClientLib(mqtt_broker, mqtt_port, mqttClientID, wifiClient, mqttCallback));

  Serial.print("IP Address: ");
  Serial.println(WiFi.localIP());

  lastMqttOkMs = millis();
}

void loop() {
    feedWatchdog();

    if (handleOta()) {
      delay(500);
      return;
    }

    ensureWifiConnected();

    // Update NTP time client
    timeClient.update();

    if (mqttClient->loop()) {
      mqttConnected = true;
      lastMqttOkMs = millis();
    } else {
      if (mqttConnected) {
        Serial.println("MQTT connection lost (last error " + String(mqttClient->lastError()) + "), reconnecting...");
        mqttConnected = false;
      }
      connectToMQTT();
    }

    if (mqttConnected) {
      syncSubscriptions();
      publishPendingStates();

      if (millis() - lastHeartbeatMs >= HEARTBEAT_INTERVAL_MS) {
        lastHeartbeatMs = millis();
        publishHeartbeat();
      }

      if (millis() - lastStateRepublishMs >= STATE_REPUBLISH_MS) {
        lastStateRepublishMs = millis();
        for (const auto& mapping : roomToPinMapping) {
          pendingStatePublishes.insert(mapping.first);
        }
      }
    } else if (millis() - lastMqttOkMs >= MQTT_STALE_REBOOT_MS) {
      // Something we cannot fix from here keeps us off the broker - start over
      Serial.println("No MQTT connection for " + String(MQTT_STALE_REBOOT_MS / 60000) +
                     " minutes, restarting the board");
      Serial.flush();
      ESP.restart();
    }

    delay(LOOP_INTERVAL_MS);
}
